#include <iostream>

/*
    0. Рендер
        - Линии толщиной "1 шмиксель"
        - Линии могут иметь толщину
        - Сглаживание

    1. Создавать разные фигуры
        - Прмиер: Отрезок
            - с координатами
            - отрезок между подвижными точкам(другими фигурами)
        - Пример: окружность
            - Соосные окружности
            - Касательная к окружности

    2. Камера: отображать разные части СК
        - Камера по-умолчанию
        - Камера в заданной позиции
        - Камера привязанная к фигуре
        - Создать/Удалить/Добавить
        - Объединение камер

    3. Операции с фигурами
        - Подвинуть "на"
        - Переметисть "в"
        - Поворот
        - Комбинация фигур
        - Слои и разные символы для отрисовки слоёв
        - Операции со слоями(пересечение, командывычитание, объединение)

    4. Сохранить/Загрузить "рабочую область"
        - Открыть
        - Закрыть
        - Удалить
        - Состояние проекта

    5. Мета-команды
        - Хелп/описание
        - Макросы (без параметрами)
        - Макросы с именованными параметрами
        - Чтение команд из файла
        - Сохранение макросов/загрузка макросов

    6. Придумайте что-нибудь ещё
        -
    7. Цветные глифы/фон
    8. Экспорт в пнг и
    9. Экспорт в свг/импорт из свг
    10. Отрисовка текста(разного размера)

    и тд.......
*/

int main()
{
}
